### Roteiro da Semana ### 
####  Comparação SQL - PANDAS (2 dias) ####
####  Pré-processamento dos dados (Limpeza, Transformação ) - 1 dia #### 
#### Modelos de Regressão Linear - 2 dias  ####

In [2]:
import pandas as pd
import sqlite3 as sql

In [3]:
engine = sql.connect('name.db')
cursor= engine.cursor()

In [4]:
url = "https://raw.github.com/pandas-dev/pandas/master/pandas/tests/io/data/csv/tips.csv"
tips= pd.read_csv(url)

### tips - Dataframe ####

In [5]:
tips.to_sql('tipsDB', con=engine)

In [6]:
### SQL - PANDAS - HEAD() ### 
sql_head = 'SELECT * FROM tipsDB LIMIT 5'
cursor.execute(sql_head).fetchall()

[(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2),
 (1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3),
 (2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3),
 (3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2),
 (4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4)]

In [7]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [10]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [11]:
### SQL x PANDAS - INFO TABLE ####
sql_infoTable = 'PRAGMA table_info(tipsDB)'
cursor.execute(sql_infoTable).fetchall()

[(0, 'index', 'INTEGER', 0, None, 0),
 (1, 'total_bill', 'REAL', 0, None, 0),
 (2, 'tip', 'REAL', 0, None, 0),
 (3, 'sex', 'TEXT', 0, None, 0),
 (4, 'smoker', 'TEXT', 0, None, 0),
 (5, 'day', 'TEXT', 0, None, 0),
 (6, 'time', 'TEXT', 0, None, 0),
 (7, 'size', 'INTEGER', 0, None, 0)]

In [15]:
tips.info()
tips.sex.map(type)

0      <class 'str'>
1      <class 'str'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
           ...
239    <class 'str'>
240    <class 'str'>
241    <class 'str'>
242    <class 'str'>
243    <class 'str'>
Name: sex, Length: 244, dtype: object

In [18]:
### SQL x PANDAS - FILTRAR POR COLUNAS 
sql_columns = 'SELECT total_bill,tip,sex FROM tipsDB LIMIT 5'
cursor.execute(sql_columns).fetchall()

[(16.99, 1.01, 'Female'),
 (10.34, 1.66, 'Male'),
 (21.01, 3.5, 'Male'),
 (23.68, 3.31, 'Male'),
 (24.59, 3.61, 'Female')]

In [28]:
# Sintaxe para acesso às colunas do DATAFRAME 
# tips["nome_da_coluna"]
#tips.nome_da_coluna

# tips.total_bill

# várias colunas 
## tips[[list de colunas]]

tips[["total_bill","tip","sex"]].head()

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [30]:
### SQL X PANDAS - ASSIGN 
sql_assign = 'SELECT *,tip/total_bill as tip_rate FROM tipsDB LIMIT 5'
cursor.execute(sql_assign)

cl=[]
for x in cursor.description:
    cl.append(x[0])

print(cl)
for row in cursor.fetchall():
    print(row)

['index', 'total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size', 'tip_rate']
(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2, 0.05944673337257211)
(1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3, 0.16054158607350097)
(2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3, 0.16658733936220846)
(3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2, 0.1397804054054054)
(4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4, 0.14680764538430255)

In [31]:
### ASSIGN - DATAFRAME ##### 
tips.assign(tip_rate=tips['tip']/tips['total_bill']).head()

   total_bill   tip     sex smoker  day    time  size  tip_rate
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [34]:
### SQL X PANDAS  -  WHERE  ####
sql_where = 'SELECT * FROM tipsDB WHERE time="Dinner" LIMIT 5'
cursor.execute(sql_where).fetchall()

[(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2),
 (1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3),
 (2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3),
 (3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2),
 (4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4)]

In [35]:
tips[tips["time"]=='Dinner'].head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [43]:
sql_where = 'SELECT * FROM tipsDB WHERE time="Dinner" AND tip > 3.00 AND tip < 4.00\
             AND(day="Sat" OR day="Sun")'
cursor.execute(sql_where).fetchall()

[(2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3),
 (3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2),
 (4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4),
 (7, 26.88, 3.12, 'Male', 'No', 'Sun', 'Dinner', 4),
 (9, 14.78, 3.23, 'Male', 'No', 'Sun', 'Dinner', 2),
 (14, 14.83, 3.02, 'Female', 'No', 'Sun', 'Dinner', 2),
 (15, 21.58, 3.92, 'Male', 'No', 'Sun', 'Dinner', 2),
 (17, 16.29, 3.71, 'Male', 'No', 'Sun', 'Dinner', 3),
 (18, 16.97, 3.5, 'Female', 'No', 'Sun', 'Dinner', 3),
 (19, 20.65, 3.35, 'Male', 'No', 'Sat', 'Dinner', 3),
 (24, 19.82, 3.18, 'Male', 'No', 'Sat', 'Dinner', 2),
 (34, 17.78, 3.27, 'Male', 'No', 'Sat', 'Dinner', 2),
 (35, 24.06, 3.6, 'Male', 'No', 'Sat', 'Dinner', 3),
 (37, 16.93, 3.07, 'Female', 'No', 'Sat', 'Dinner', 3),
 (42, 13.94, 3.06, 'Male', 'No', 'Sun', 'Dinner', 2),
 (55, 19.49, 3.51, 'Male', 'No', 'Sun', 'Dinner', 2),
 (60, 20.29, 3.21, 'Male', 'Yes', 'Sat', 'Dinner', 2),
 (63, 18.29, 3.76, 'Male', 'Yes', 'Sat', 'Dinner', 4),
 (65, 20.08, 3.15, 'Male', 'No', 'Sat', 'Dinner', 3),
 (72, 26.86, 3.14, 'Female', 'Yes', 'Sat', 'Dinner', 2),
 (76, 17.92, 3.08, 'Male', 'Yes', 'Sat', 'Dinner', 2),
 (103, 22.42, 3.48, 'Female', 'Yes', 'Sat', 'Dinner', 2),
 (108, 18.24, 3.76, 'Male', 'No', 'Sat', 'Dinner', 2),
 (115, 17.31, 3.5, 'Female', 'No', 'Sun', 'Dinner', 2),
 (157, 25.0, 3.75, 'Female', 'No', 'Sun', 'Dinner', 4),
 (160, 21.5, 3.5, 'Male', 'No', 'Sun', 'Dinner', 4),
 (165, 24.52, 3.48, 'Male', 'No', 'Sun', 'Dinner', 3),
 (171, 15.81, 3.16, 'Male', 'Yes', 'Sat', 'Dinner', 2),
 (173, 31.85, 3.18, 'Male', 'Yes', 'Sun', 'Dinner', 2),
 (175, 32.9, 3.11, 'Male', 'Yes', 'Sun', 'Dinner', 2),
 (179, 34.63, 3.55, 'Male', 'Yes', 'Sun', 'Dinner', 2),
 (180, 34.65, 3.68, 'Male', 'Yes', 'Sun', 'Dinner', 4),
 (182, 45.35, 3.5, 'Male', 'Yes', 'Sun', 'Dinner', 3),
 (186, 20.9, 3.5, 'Female', 'Yes', 'Sun', 'Dinner', 3),
 (188, 18.15, 3.5, 'Female', 'Yes', 'Sun', 'Dinner', 3),
 (206, 26.59, 3.41, 'Male', 'Yes', 'Sat', 'Dinner', 3),
 (219, 30.14, 3.09, 'Female', 'Yes', 'Sat', 'Dinner', 4),
 (232, 11.61, 3.39, 'Male', 'No', 'Sat', 'Dinner', 2)]

In [50]:
tips[(tips['time']=='Dinner')&(tips['tip'] > 3)&(tips['tip'] < 4)\
     & ((tips['day']=='Sun') | (tips['day']=='Sat'))].head()

   total_bill   tip     sex smoker  day    time  size
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
7       26.88  3.12    Male     No  Sun  Dinner     4
9       14.78  3.23    Male     No  Sun  Dinner     2

In [ ]:
### SQL X PANDAS - UPDATE #####

In [ ]:
header_list = ["personid", "firstname", "middleinitial","lastname","dateofbirth"]
path_file = "/Users/charles/Documents/Infnet/Semana4/Sample/SamplePersonData"
df_Person = pd.read_csv(path_file, names=header_list)
df_Person

In [ ]:
header_list = ["studentid", "personid", "email"]
path_file = "/Users/charles/Documents/Infnet/Semana4/Sample/SampleStudentData"
df_Student = pd.read_csv(path_file, names=header_list)
df_Student

In [ ]:
header_list = ["courseid", "name", "teacher"]
path_file = "/Users/charles/Documents/Infnet/Semana4/Sample/SampleCourseData"
df_Course = pd.read_csv(path_file, names=header_list)
df_Course

In [ ]:
header_list = ["studentid", "courseid", "grade","attempt"]
path_file = "/Users/charles/Documents/Infnet/Semana4/Sample/SampleCreditData"
df_Credit = pd.read_csv(path_file, names=header_list)
df_Credit